src/Catalogs/ОСМИ_ШаблоныЭлектронныхКарт/ОСМИ_ШаблоныЭлектронныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОСМИ_ШаблоныЭлектронныхКарт</name>
  <attributes>
    <name>СодержимоеБаркода</name>
    <type>
      <types>EnumRef.ОСМИ_СодержимоеБаркодаПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияСодержимогоБаркода</name>
    <type>
      <types>CatalogRef.ОСМИ_ИсточникиДанных</types>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьБаркод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержимоеПодписи</name>
    <type>
      <types>EnumRef.ОСМИ_СодержимоеБаркодаПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияСодержимогоПодписи</name>
    <type>
      <types>CatalogRef.ОСМИ_ИсточникиДанных</types>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестОповещенияПриОтправкеКартыПоSMS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТестОповещенияПриОтправкеКартыПоЭлектроннойПочте</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоляШаблона</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>46</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПолучения</name>
      <type>
        <types>CatalogRef.ОСМИ_ИсточникиДанных</types>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОповещения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтправлятьПУШ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ОСМИ_СодержимоеБаркодаПодписи/ОСМИ_СодержимоеБаркодаПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОСМИ_СодержимоеБаркодаПодписи</name>
  <enumValues>
    <name>СерийныйНомер</name>
  </enumValues>
  <enumValues>
    <name>Текст</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ОСМИ_ИсточникиДанных/ОСМИ_ИсточникиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОСМИ_ИсточникиДанных</name>
  <predefined>
    <items>
      <name>Баланс</name>
      <description>Баланс</description>
    </items>
    <items>
      <name>ДатаРождения</name>
      <description>Дата рождения</description>
    </items>
    <items>
      <name>Имя</name>
      <description>Имя</description>
    </items>
    <items>
      <name>Телефон</name>
      <description>Телефон</description>
    </items>
    <items>
      <name>ФИО</name>
      <description>ФИО</description>
    </items>
    <items>
      <name>Штрихкод</name>
      <description>Штрихкод</description>
    </items>
    <items>
      <name>ЭлектроннаяПочта</name>
      <description>Электронная почта</description>
    </items>
  </predefined>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолеОсновногоОтбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличнаяЧасть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартаДляПроверки</name>
    <type>
      <types>DefinedType.ОСМИ_ДисконтнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПрограммы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Отборы</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСравнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ОСМИ_ШаблоныЭлектронныхКарт/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПерезаполнитьПоля(Команда)
	
	ПерезаполнитьПоляНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоляНаСервере()
	
	тчПоля = Объект.ПоляШаблона;
	тчПоля.Очистить();
	
	ЭтаФорма.Модифицированность = Истина;
	
	ДанныеШаблона = ОСМИ_РаботаСAPI.ЗапроситьИнформациюОШаблоне(Объект.Наименование);
	Если НЕ ДанныеШаблона.Успех Тогда
		Сообщить("Не удалось получить данные шаблона с сервера ОСМИ");
		Возврат;
	КонецЕсли;

	Для Каждого Поле Из ДанныеШаблона.Ответ.values Цикл
		НовПоле = тчПоля.Добавить();
		НовПоле.Имя = Поле.label;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СодержимоеБаркодаПриИзменении(Элемент)
		
	Если Объект.СодержимоеБаркода <> ПредопределенноеЗначение("Перечисление.ОСМИ_СодержимоеБаркодаПодписи.Текст") Тогда
		Объект.СпособПолученияСодержимогоБаркода = ПредопределенноеЗначение("Справочник.ОСМИ_ИсточникиДанных.ПустаяСсылка");
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СодержимоеПодписиПриИзменении(Элемент)
	
	Если Объект.СодержимоеПодписи <> ПредопределенноеЗначение("Перечисление.ОСМИ_СодержимоеБаркодаПодписи.Текст") Тогда
		Объект.СпособПолученияСодержимогоПодписи = ПредопределенноеЗначение("Справочник.ОСМИ_ИсточникиДанных.ПустаяСсылка");
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовФормы()
	
	НуженСпособПолученияСодержимогоБаркода =
		Объект.СодержимоеБаркода = ПредопределенноеЗначение("Перечисление.ОСМИ_СодержимоеБаркодаПодписи.Текст");
	НуженСпособПолученияСодержимогоПодписи =
		Объект.СодержимоеПодписи = ПредопределенноеЗначение("Перечисление.ОСМИ_СодержимоеБаркодаПодписи.Текст");
		
	Элементы.СпособПолученияСодержимогоБаркода.Видимость = НуженСпособПолученияСодержимогоБаркода;
	Элементы.СпособПолученияСодержимогоБаркода.АвтоОтметкаНезаполненного = НуженСпособПолученияСодержимогоБаркода;
	Элементы.СпособПолученияСодержимогоПодписи.Видимость = НуженСпособПолученияСодержимогоПодписи;
	Элементы.СпособПолученияСодержимогоПодписи.АвтоОтметкаНезаполненного = НуженСпособПолученияСодержимогоПодписи;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.СодержимоеБаркода = ПредопределенноеЗначение("Перечисление.ОСМИ_СодержимоеБаркодаПодписи.Текст") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.СпособПолученияСодержимогоБаркода) Тогда
			Сообщить("Не задан способ получения содержимого Баркода");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.СодержимоеПодписи = ПредопределенноеЗначение("Перечисление.ОСМИ_СодержимоеБаркодаПодписи.Текст") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.СпособПолученияСодержимогоПодписи) Тогда
			Сообщить("Не задан способ получения содержимого подписи Баркода");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
